## **Chapter 3   Missing Data**

In [53]:
import pandas as pd
import numpy as np

**1) TO find the missing Data**

In [54]:
data = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [1, 2, 3, 4, 5],
    'C': [1, 2, 3, np.nan, np.nan],
    'D': [1, np.nan, np.nan, np.nan, 5]    #these "nan" are missing values
}
df = pd.DataFrame(data)

In [55]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

* To find the missing value we will use ***' isna( ) '*** and where there is missing value it will give true and where there is not missing value it will give false.

In [56]:
df.isna()

       A      B      C      D
0  False  False  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False

In [57]:
df.isna().sum()   # to find the total number of missing values in each column

A    1
B    0
C    2
D    3
dtype: int64

In [58]:
df.isna().any()   # to check if there is any missing value in each column

A     True
B    False
C     True
D     True
dtype: bool

**2) Removing Missing DATA**

In [59]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [60]:
df.dropna()   # to drop rows with any missing values

     A  B    C    D
0  1.0  1  1.0  1.0

In [61]:
df.dropna(thresh=3)   # to drop rows with at least 3 non-missing values

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
4  5.0  5  NaN  5.0

* **df.dropna(thresh=' ')** where thresh is the threshold value that will drop the row that has ***less then the threshold value***

In [ ]:
df.dropna(thresh=4)   
# to drop rows with at least 4 non-missing values

     A  B    C    D
0  1.0  1  1.0  1.0

**3) Filling the missing Data**

In [63]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [ ]:
df.fillna('hello')   
# to fill missing values with a specific value

       A  B      C      D
0    1.0  1    1.0    1.0
1    2.0  2    2.0  hello
2  hello  3    3.0  hello
3    4.0  4  hello  hello
4    5.0  5  hello    5.0

In [ ]:
df.fillna(0)   
# to fill missing values with 0

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  0.0
2  0.0  3  3.0  0.0
3  4.0  4  0.0  0.0
4  5.0  5  0.0  5.0

In [67]:
add_miss_value = {
    'A': 700,
    'B': 800,
    'C': 900,
    'D': 600
}
df.fillna(value=add_miss_value)   
# to fill missing values with different values for each column

       A  B      C      D
0    1.0  1    1.0    1.0
1    2.0  2    2.0  600.0
2  700.0  3    3.0  600.0
3    4.0  4  900.0  600.0
4    5.0  5  900.0    5.0

* all these are for temprory data

In [68]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0